#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Reading...[0m[0m
[0m[1maws_resourceexplorer2_index.index-example5: Refreshing state... [id=arn:aws:resource-explorer-2:us-east-1:199660179115:index/f6033c65-0360-40a9-b32c-7128b428ae3a][0m
[0m[1maws_kms_key_policy.key-policy: Refreshing state... [id=3c0ec1b6-3aed-4343-ae90-f53636ae1d1e][0m
[0m[1maws_resourceexplorer2_view.view-example5: Refreshing state... [id=arn:aws:resource-explorer-2:us-east-1:199660179115:view/exampleview7/f689085a-25f2-4e42-a8dc-1984a6fc3c63][0m
[0m[1maws_kms_alias.kms-alias: Refreshing state... [id=alias/cloudtrail-key][0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1maws_kms_key.cloudtrail-key: Refreshing state... [id=3c0ec1b6-3aed-4343-ae90-f53636ae1d1e][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Read complete after 0s [id=1789900679][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=199660179115][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Read complete after 0s [id=1243534753][0m
[0m[1maws_iam_role.github_deployment_oidc_role: Refreshing state... [id=github-deployment-oidc-role][0m
[0m[1maws_iam_role_policy.github_actions_role_policy: Refreshing state... [id=github-deployment-oidc-role:github_deployment_oidc_role_policy][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # aws_kms_alias.kms-alias[0m will be [1m[31mdestroyed[0m
  # (because aws_kms_alias.kms-alias is not in configuration)
[0m  [31m-[0m[0m resource "aws_kms_alias" "kms-alias" {
      [31m-[0m[0m arn            = "arn:aws:kms:us-east-1:199660179115:alias/cloudtrail-key" [90m-> null[0m[0m
      [31m-[0m[0m id             = "alias/cloudtrail-key" [90m-> null[0m[0m
      [31m-[0m[0m name           = "alias/cloudtrail-key" [90m-> null[0m[0m
      [31m-[0m[0m target_key_arn = "arn:aws:kms:us-east-1:199660179115:key/3c0ec1b6-3aed-4343-ae90-f53636ae1d1e" [90m-> null[0m[0m
      [31m-[0m[0m target_key_id  = "3c0ec1b6-3aed-4343-ae90-f53636ae1d1e" [90m-> null[0m[0m
    }

[1m  # aws_resourceexplorer2_index.index-example5[0m will be [1m[31mdestroyed[0m
  # (because aws_resourceexplorer2_index.index-example5 is not in configuration)
[0m  [31m-[0m[0m resource "aws_resourceexplorer2_index" "index-example5" {
      [31m-[0m[0m arn      = "arn:aws:resource-explorer-2:us-east-1:199660179115:index/f6033c65-0360-40a9-b32c-7128b428ae3a" [90m-> null[0m[0m
      [31m-[0m[0m id       = "arn:aws:resource-explorer-2:us-east-1:199660179115:index/f6033c65-0360-40a9-b32c-7128b428ae3a" [90m-> null[0m[0m
      [31m-[0m[0m tags_all = {} [90m-> null[0m[0m
      [31m-[0m[0m type     = "AGGREGATOR" [90m-> null[0m[0m
    }

[1m  # aws_resourceexplorer2_view.view-example5[0m will be [1m[31mdestroyed[0m
  # (because aws_resourceexplorer2_view.view-example5 is not in configuration)
[0m  [31m-[0m[0m resource "aws_resourceexplorer2_view" "view-example5" {
      [31m-[0m[0m arn          = "arn:aws:resource-explorer-2:us-east-1:199660179115:view/exampleview7/f689085a-25f2-4e42-a8dc-1984a6fc3c63" [90m-> null[0m[0m
      [31m-[0m[0m default_view = true [90m-> null[0m[0m
      [31m-[0m[0m id           = "arn:aws:resource-explorer-2:us-east-1:199660179115:view/exampleview7/f689085a-25f2-4e42-a8dc-1984a6fc3c63" [90m-> null[0m[0m
      [31m-[0m[0m name         = "exampleview7" [90m-> null[0m[0m
      [31m-[0m[0m tags_all     = {} [90m-> null[0m[0m

      [31m-[0m[0m included_property {
          [31m-[0m[0m name = "tags" [90m-> null[0m[0m
        }
    }

[1m  # aws_vpc.test-vpc[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "test-vpc" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "10.7.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = (known after apply)
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "niki-vpc"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "niki-vpc"
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 3 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dtaylor77, Action: `pull_request`, Workflow: `Aquanow Infrastructure DEV Pipeline`*